micropython/micropython/ports/wch/bsp/src/ch32v30x_flash.c
    if (FLASH_FLAG == FLASH_FLAG_OPTERR) {
        if ((FLASH->OBR & FLASH_FLAG_OPTERR) != (uint32_t)RESET) {
            bitstatus = SET;
        } else {
            bitstatus = RESET;
        }
    } else {
        if ((FLASH->STATR & FLASH_FLAG) != (uint32_t)RESET) {
            bitstatus = SET;
        } else {
            bitstatus = RESET;
        }
    }
    return bitstatus;
}

/*********************************************************************
 * @fn      FLASH_ClearFlag
 *
 * @brief   Clears the FLASH's pending flags.
 *
 * @param   FLASH_FLAG - specifies the FLASH flags to clear.
 *            FLASH_FLAG_PGERR - FLASH Program error flag
 *            FLASH_FLAG_WRPRTERR - FLASH Write protected error flag
 *            FLASH_FLAG_EOP - FLASH End of Operation flag
 *
 * @return  none
 */
void FLASH_ClearFlag(uint32_t FLASH_FLAG) {
    FLASH->STATR = FLASH_FLAG;
}

/*********************************************************************
 * @fn      FLASH_GetStatus
 *
 * @brief   Returns the FLASH Status.
 *
 * @return  FLASH Status - The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *        FLASH_ERROR_WRP or FLASH_COMPLETE.
 */
FLASH_Status FLASH_GetStatus(void) {
    FLASH_Status flashstatus = FLASH_COMPLETE;

    if ((FLASH->STATR & FLASH_FLAG_BSY) == FLASH_FLAG_BSY) {
        flashstatus = FLASH_BUSY;
    } else {
        if ((FLASH->STATR & FLASH_FLAG_PGERR) != 0) {
            flashstatus = FLASH_ERROR_PG;
        } else {
            if ((FLASH->STATR & FLASH_FLAG_WRPRTERR) != 0) {
                flashstatus = FLASH_ERROR_WRP;
            } else {
                flashstatus = FLASH_COMPLETE;
            }
        }
    }
    return flashstatus;
}

/*********************************************************************
 * @fn      FLASH_GetBank1Status
 *
 * @brief   Returns the FLASH Bank1 Status.
 *
 * @return  FLASH Status - The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *        FLASH_ERROR_WRP or FLASH_COMPLETE.
 */
FLASH_Status FLASH_GetBank1Status(void) {
    FLASH_Status flashstatus = FLASH_COMPLETE;

    if ((FLASH->STATR & FLASH_FLAG_BANK1_BSY) == FLASH_FLAG_BSY) {
        flashstatus = FLASH_BUSY;
    } else {
        if ((FLASH->STATR & FLASH_FLAG_BANK1_PGERR) != 0) {
            flashstatus = FLASH_ERROR_PG;
        } else {
            if ((FLASH->STATR & FLASH_FLAG_BANK1_WRPRTERR) != 0) {
                flashstatus = FLASH_ERROR_WRP;
            } else {
                flashstatus = FLASH_COMPLETE;
            }
        }
    }
    return flashstatus;
}

/*********************************************************************
 * @fn      FLASH_WaitForLastOperation
 *
 * @brief   Waits for a Flash operation to complete or a TIMEOUT to occur.
 *
 * @param   Timeout - FLASH programming Timeout
 *
 * @return  FLASH Status - The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *        FLASH_ERROR_WRP or FLASH_COMPLETE.
 */
FLASH_Status FLASH_WaitForLastOperation(uint32_t Timeout) {
    FLASH_Status status = FLASH_COMPLETE;

    status = FLASH_GetBank1Status();
    while ((status == FLASH_BUSY) && (Timeout != 0x00)) {
        status = FLASH_GetBank1Status();
        Timeout--;
    }
    if (Timeout == 0x00) {
        status = FLASH_TIMEOUT;
    }
    return status;
}

/*********************************************************************
 * @fn      FLASH_WaitForLastBank1Operation
 *
 * @brief   Waits for a Flash operation on Bank1 to complete or a TIMEOUT to occur.
 *
 * @param   Timeout - FLASH programming Timeout
 *
 * @return  FLASH Status - The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *        FLASH_ERROR_WRP or FLASH_COMPLETE.
 */
FLASH_Status FLASH_WaitForLastBank1Operation(uint32_t Timeout) {
    FLASH_Status status = FLASH_COMPLETE;

    status = FLASH_GetBank1Status();
    while ((status == FLASH_FLAG_BANK1_BSY) && (Timeout != 0x00)) {
        status = FLASH_GetBank1Status();
        Timeout--;
    }
    if (Timeout == 0x00) {
        status = FLASH_TIMEOUT;
    }
    return status;
}

/*********************************************************************
 * @fn      FLASH_Unlock_Fast
 *
 * @brief   Unlocks the Fast Program Erase Mode.
 *
 * @return  none
 */
void FLASH_Unlock_Fast(void) {
    /* Authorize the FPEC of Bank1 Access */
    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;

    /* Fast program mode unlock */
    FLASH->MODEKEYR = FLASH_KEY1;
    FLASH->MODEKEYR = FLASH_KEY2;
}

/*********************************************************************
 * @fn      FLASH_Lock_Fast
 *
 * @brief   Locks the Fast Program Erase Mode.
 *
 * @return  none
 */
void FLASH_Lock_Fast(void) {
    FLASH->CTLR |= CR_LOCK_Set;
}

/*********************************************************************
 * @fn      FLASH_ErasePage_Fast
 *
 * @brief   Erases a specified FLASH page (1page = 256Byte).
 *
 * @param   Page_Address - The page address to be erased.
 *
 * @return  none
 */
void FLASH_ErasePage_Fast(uint32_t Page_Address) {
    Page_Address &= 0xFFFFFF00;

    FLASH->CTLR |= CR_PAGE_ER;
    FLASH->ADDR = Page_Address;
    FLASH->CTLR |= CR_STRT_Set;
    while (FLASH->STATR & SR_BSY) {
        ;
    }
    FLASH->CTLR &= ~CR_PAGE_ER;
}

/*********************************************************************
 * @fn      FLASH_EraseBlock_32K_Fast
 *
 * @brief   Erases a specified FLASH Block (1Block = 32KByte).
 *
 * @param   Block_Address - The block address to be erased.
 *
 * @return  none
 */
void FLASH_EraseBlock_32K_Fast(uint32_t Block_Address) {
    Block_Address &= 0xFFFF8000;

    FLASH->CTLR |= CR_BER32;
    FLASH->ADDR = Block_Address;
    FLASH->CTLR |= CR_STRT_Set;
    while (FLASH->STATR & SR_BSY) {
        ;
    }
    FLASH->CTLR &= ~CR_BER32;
}

/*********************************************************************
 * @fn      FLASH_EraseBlock_64K_Fast
 *
 * @brief   Erases a specified FLASH Block (1Block = 64KByte).
 *
 * @param   Block_Address - The block address to be erased.
 *
 * @return  none
 */
void FLASH_EraseBlock_64K_Fast(uint32_t Block_Address) {
    Block_Address &= 0xFFFF0000;

    FLASH->CTLR |= CR_BER64;
    FLASH->ADDR = Block_Address;
    FLASH->CTLR |= CR_STRT_Set;
    while (FLASH->STATR & SR_BSY) {
        ;
    }
    FLASH->CTLR &= ~CR_BER64;
}

/*********************************************************************
 * @fn      FLASH_ProgramPage_Fast
 *
 * @brief   Program a specified FLASH page (1page = 256Byte).
 *
 * @param   Page_Address - The page address to be programed.
 *
 * @return  none
 */
void FLASH_ProgramPage_Fast(uint32_t Page_Address, uint32_t *pbuf) {
    uint8_t size = 64;

    Page_Address &= 0xFFFFFF00;

    FLASH->CTLR |= CR_PAGE_PG;
    while (FLASH->STATR & SR_BSY) {
        ;
    }
    while (FLASH->STATR & SR_WR_BSY) {
        ;
    }

    while (size) {
        *(uint32_t *)Page_Address = *(uint32_t *)pbuf;
        Page_Address += 4;
        pbuf += 1;
        size -= 1;
        while (FLASH->STATR & SR_WR_BSY) {
            ;
        }
    }

    FLASH->CTLR |= CR_PG_STRT;
    while (FLASH->STATR & SR_BSY) {
        ;
    }
    FLASH->CTLR &= ~CR_PAGE_PG;
}

/*********************************************************************
 * @fn      FLASH_Enhance_Mode
 *
 * @brief   Read FLASH Enhance Mode
 *
 * @param   FLASH_Enhance_CLK -
 *            FLASH_Enhance_SYSTEM_HALF - System clock/2
 *            FLASH_Enhance_SYSTEM - System clock
 *          Newstate - new state of the ReadOut Protection(ENABLE or DISABLE).
 *
 * @return  none
 */
void FLASH_Enhance_Mode(uint32_t FLASH_Enhance_CLK, FunctionalState NewState) {
    FLASH->CTLR &= ~(1 << 25);
    FLASH->CTLR |= FLASH_Enhance_CLK;

    if (NewState) {
        FLASH->CTLR |= (1 << 24);
    } else {
        FLASH->CTLR &= ~(1 << 24);
        FLASH->CTLR |= (1 << 22);
    }
}
